FKDD_COPY_DIFF_3_2026-02-14/Reports/СводнаяВедомостьРасчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>СводнаяВедомостьРасчетов</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>текСотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СУчетомКорректировки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Выработка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-14/InformationRegisters/СведенияКомпании.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СведенияКомпании</Name>
			<Comment>Некоторые сведения о компании которые могут измениться со временем (например гл. бухгалтер, руководитель...)</Comment>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Comment>Значение сведения</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>cfg:EnumRef.СтратегияСписанияПартийТоваровПоСтатусам</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:EnumRef.СтратегияСписанияПартийТоваровПоДатам</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Comment>Организация</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Comment>Вид сведения</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОбъектовСведений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-14/Enums/Периодичность.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>Периодичность</Name>
			<Comment>Периодичность</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Неделя</Name>
					<Comment>Неделя</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Декада</Name>
					<Comment>Декада</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Месяц</Name>
					<Comment>Месяц</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Квартал</Name>
					<Comment>Квартал</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Год</Name>
					<Comment>Год</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Произвольный</Name>
					<Comment>Произвольный</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-14/Enums/ВидыОбъектовСведений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыОбъектовСведений</Name>
			<Comment>Виды объектов сведений</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Руководитель</Name>
					<Comment>Руководитель</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГлавныйБухгалтер</Name>
					<Comment>Главный бухгалтер</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Кассир</Name>
					<Comment>Кассир</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МОЛ</Name>
					<Comment>Материально ответственное лицо</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтратегияСписанияПоДатам</Name>
					<Comment>Стратегия списания партий товаров по датам</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтратегияСписанияПоСтатусам</Name>
					<Comment>Стратегия списания партий товаров по статусам</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СрокПоставки</Name>
					<Comment>Срок поставки</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-14/Reports/СводнаяВедомостьРасчетов/Ext/ObjectModule.bsl
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	// // Получаем необходимую СКД.	НеобходимаяСКД = Неопределено;
	//Если НЕ ЭтотОбъект.Выработка Тогда
	//	НеобходимаяСКД = ЭтотОбъект.ПолучитьМакет("ОбщийЛистРасчета");
	//ИначеЕсли ЭтотОбъект.Выработка Тогда
	//	НеобходимаяСКД = ЭтотОбъект.ПолучитьМакет("ВыборкаЛистРасчета");
	//КонецЕсли;
	
	 //// Устанавливаем выбранную СКД как основную.
	 //ЭтотОбъект.СхемаКомпоновкиДанных = НеобходимаяСКД;
	
	  //Устанавливаем настройки.
	 ПараметрыДанных = ЭтотОбъект.КомпоновщикНастроек.Настройки.ПараметрыДанных;
	 ПараметрПериодРегистрации = Новый ПараметрКомпоновкиДанных("ПериодРегистрации");
	 ЗначениеПараметрПериодРегистрации = ПараметрыДанных.НайтиЗначениеПараметра(ПараметрПериодРегистрации);
	 Если ЗначениеПараметрПериодРегистрации <> Неопределено Тогда
	     ПараметрыДанных.УстановитьЗначениеПараметра(ПараметрПериодРегистрации, ЭтотОбъект.ПериодРегистрации);
	 КонецЕсли;
	 
	 МасПериодичности = новый Массив;
	 МасПериодичности.Добавить(Перечисления.Периодичность.Месяц);
	 //МасПериодичности.Добавить(Перечисления.Периодичность.Квартал);
	 //МасПериодичности.Добавить(Перечисления.Периодичность.Год);

	 ПараметрыДанных = ЭтотОбъект.КомпоновщикНастроек.Настройки.ПараметрыДанных;
	 ПараметрПериодичность = Новый ПараметрКомпоновкиДанных("Периодичность");
	 ЗначениеПараметрПериодичность = ПараметрыДанных.НайтиЗначениеПараметра(ПараметрПериодичность);
	 Если ЗначениеПараметрПериодичность <> Неопределено Тогда
	     ПараметрыДанных.УстановитьЗначениеПараметра(ПараметрПериодичность, МасПериодичности);
	 КонецЕсли;
	
	 ПараметрыДанных = ЭтотОбъект.КомпоновщикНастроек.Настройки.ПараметрыДанных;
	 ПараметрТолькоОрганизация = Новый ПараметрКомпоновкиДанных("Организация");
	 ЗначениеТолькоОрганизация = ПараметрыДанных.НайтиЗначениеПараметра(ПараметрТолькоОрганизация);
	 Если ЗначениеТолькоОрганизация <> Неопределено Тогда
	     ПараметрыДанных.УстановитьЗначениеПараметра(ПараметрТолькоОрганизация, ЭтотОбъект.Организация);
	 КонецЕсли;
 
	 СтруктураОтбора=Новый Структура("Организация, Объект", ЭтотОбъект.Организация, Перечисления.ВидыОбъектовСведений.Руководитель);
	 СтруктураСведений=РегистрыСведений.СведенияКомпании.ПолучитьПоследнее(КонецМесяца(ЭтотОбъект.ПериодРегистрации),СтруктураОтбора);
	 
	 Если ЗначениеЗаполнено(СтруктураСведений.Значение) тогда
		 
		 ПараметрыДанных = ЭтотОбъект.КомпоновщикНастроек.Настройки.ПараметрыДанных;
		 ПараметрТолькоДиректорДолжность = Новый ПараметрКомпоновкиДанных("ДолжностьДиректора");
		 ЗначениеТолькоДиректорДолжность = ПараметрыДанных.НайтиЗначениеПараметра(ПараметрТолькоДиректорДолжность);
		 Если ЗначениеТолькоДиректорДолжность <> Неопределено Тогда
			 ПараметрыДанных.УстановитьЗначениеПараметра(ПараметрТолькоДиректорДолжность, СтруктураСведений.Значение.Должность);
		 КонецЕсли;
		 
		 ПараметрыДанных = ЭтотОбъект.КомпоновщикНастроек.Настройки.ПараметрыДанных;
		 ПараметрТолькоДиректор = Новый ПараметрКомпоновкиДанных("Директор");
		 ЗначениеТолькоДиректор = ПараметрыДанных.НайтиЗначениеПараметра(ПараметрТолькоДиректор);
		 Если ЗначениеТолькоДиректор <> Неопределено Тогда
			 ПараметрыДанных.УстановитьЗначениеПараметра(ПараметрТолькоДиректор, Мотивация.ФИО(СтруктураСведений.Значение));
		 КонецЕсли;
		 
	 КонецЕсли;

КонецПроцедуры
